In [56]:
import numpy as np
import pandas as pd
path = 'C:/Users/Abdullah Rashid/Desktop/Data Analysis with Python Udemy Course/Pandas+Course+Resources/Pandas Course Resources/retail/transactions.csv'
trans = pd.read_csv(path)
trans

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [33]:
(trans['transactions']>2000).mean()*100  # percentage of No. of Times the transactions are more than 2000 (out of total transaction)

26.680481027213492

In [52]:
((trans['transactions'] > 2000) & (trans['store_nbr'] == 25)).mean()*100

0.06707550785741663

In [40]:
trans.loc[((trans['transactions'] > 2000) & (trans['store_nbr'] == 25)),'transactions'].sum()

144903

In [50]:
mask= ((trans['transactions'] < 2000) & (((trans['store_nbr'] == 25)|(trans['store_nbr'] == 31)) & ((trans['date'].str[5:7] == ('05')) | (trans['date'].str[5:7] ==('06')) ) ))
trans.loc[mask,'transactions'].sum()

644910

In [58]:
trans

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [65]:
trans3 = trans.query("store_nbr in [25,31] and date.str[6] in ['5','6'] and transactions < 2000") # same result as above
trans3['transactions'].sum() # so sometime writing with query benefits us

644910